/*==========================================================================================
ヘッダファイル説明:
		キーボートの入力を受付するクラスのヘッダ
==========================================================================================*/
#ifndef INPUT_H_
#define INPUT_H_

/*==========================================================================================
	マクロ
==========================================================================================*/
#define KEY_MAX (256)

/*==========================================================================================
	クラス定義
==========================================================================================*/
class Input
{
public:
	static bool Init(void);				//初期化
	static void Update(void);			//キー入力更新

	static bool GetPress(int key);		//Press
	static bool GetTrigger(int key);	//Trigger
	static bool GetRelease(int key);	//Release
	static bool GetRepeat(int key);		//Repeat

private:
	static char m_Key[KEY_MAX];			//今のフレームのキー入力データ
	static char m_OldKey[KEY_MAX];		//前のフレームのキー入力データ
	static int	m_RepeatTime[KEY_MAX];	//リピータ用
};

#endif