/*==========================================================================================
	インクルードヘッダ
==========================================================================================*/
#include "FPS.h"
#include "DxLib.h"

/*==========================================================================================
	マクロ
==========================================================================================*/
#define FPS_FONT_SIZE (20)

/*==========================================================================================
	コンストラクター
==========================================================================================*/
FPS::FPS() 
{
	m_SetFrameRate = DEFAULT_FRAME_RATE;
	m_FrameRateNow = (float)m_SetFrameRate;
	m_TookTime = 0;
	m_Count = 0;
}

/*==========================================================================================
	フレームレートを指定できるコンストラクター
==========================================================================================*/
FPS::FPS(int FrameRate) 
{
	if (FrameRate < 1) FrameRate = DEFAULT_FRAME_RATE;
	m_SetFrameRate = FrameRate;
	m_FrameRateNow = (float)m_SetFrameRate;
	m_TookTime = 0;
	m_Count = 0;
}

/*==========================================================================================
	更新処理
==========================================================================================*/
void FPS::Update(const int& TookTime)
{
	m_Count++;				//カウントアップ
	m_TookTime += TookTime;	//時間蓄積

	//設定されたフレームレートより大きいなら
	if (m_Count >= m_SetFrameRate)
	{
		m_FrameRateNow = (1000.0f / m_TookTime) * m_SetFrameRate;	//フレームレート計算
		m_TookTime = 0;		//蓄積した時間を0に戻す
		m_Count = 1;		//カウントを0に戻す
	}
}

/*==========================================================================================
	描画処理
==========================================================================================*/
void FPS::Draw(void)
{
	//文字サイズ指定
	SetFontSize(FPS_FONT_SIZE);

	//FPS描画
	int CanDraw = DrawFormatString(0,0,GetColor(255,255,255),"FPS:%.1f", m_FrameRateNow);
}

/*==========================================================================================
	描画処理
==========================================================================================*/
void FPS::SetFrameRate(int FrameRate)
{
	if (FrameRate < 1) FrameRate = DEFAULT_FRAME_RATE;
	m_SetFrameRate = FrameRate;
	m_FrameRateNow = (float)m_SetFrameRate;
	m_Count = 0;
}