/*==========================================================================================
ヘッダファイル説明:
	ゲーム内データのやり取りを司るクラスのヘッダ
==========================================================================================*/
#ifndef DATA_EXCHANGE_H_
#define DATA_EXCHANGE_H_

/*==========================================================================================
	先方宣言
==========================================================================================*/
class Puyo;
class Stage;

/*==========================================================================================
	クラス定義
==========================================================================================*/
class DataExchange 
{
public:
	static int WriteDataInPuyo(Puyo* pOut, const Puyo* pIn);				//pInぷよのデータをpOutぷよに書き込む
	static int WritePuyoDataInStage(Stage* pStage, const Puyo* pPuyo);		//ぷよのデータをステージに書き込む
};

#endif