/*==========================================================================================
ヘッダファイル説明:
	操作説明のクラスのヘッダ
==========================================================================================*/
#ifndef HELP_H_
#define HELP_H_

/*==========================================================================================
	クラス定義
==========================================================================================*/
class ControlHelp
{
public:
	ControlHelp();
	~ControlHelp();

	bool Init(void);
	void Update(void);
	void Draw(void);
	void Uninit(void);
private:
	int	m_HelpImageHandle;		//操作説明の画像ハンドル
	int	m_HelpFontHandle;		//操作説明のボタン画像ハンドル
	bool m_ShowHelp;			//操作説明を表示するフラグ
};

#endif