/*==========================================================================================
	ヘッダファイル説明:
		ぷよのNextを管理するクラス
==========================================================================================*/
#ifndef PUYO_NEXT_H_
#define PUYO_NEXT_H_

/*==========================================================================================
	インクルードヘッダ
==========================================================================================*/
#include "Common.h"
#include "Puyo.h"

/*==========================================================================================
	マクロ
==========================================================================================*/
#define NEXT_STORAGE (2)
#define PUYO_NUM (2)

/*==========================================================================================
	クラス定義
==========================================================================================*/
class NextPuyo
{
public:
	NextPuyo();
	~NextPuyo();
	
	bool Init(void);	//初期化処理
	void Draw(void);	//描画処理
	void Uninit(void);	//終了処理

	void GetNextPuyo(int pOut[PUYO_NUM]);		//ネクストぷよの形取得

private:
	int		m_NextPuyoMtx[NEXT_STORAGE][PUYO_NUM];	//ネクストぷよを保存する配列
	int		m_PuyoImageHandle[PUYO_TYPE_MAX];		//ぷよの画像ハンドル
	int		m_WindowImageHandle;					//ウィンドウ画像ハンドル
};

#endif